print("Дана послідовність, що містить від 2 до 20 слів, в кожному з яких від 1\n"
      "до 5 малих латинських букв; між сусідніми словами - не менше одного пробілу, за\n"
      "останнім словом - крапка. Вивести на екран ті слова послідовності, які відмінні від\n"
      "останнього слова, і послідовно розташовані букви слів збігаються з початковим\n"
      "відрізком українського алфавіту (а, аб, абв, і т.д.).\n")
# список слов для проверки
text = ['абвг', 'аб', 'абвгґ', 'абв', 'а', 'лак', 'в', 'вава', 'а', '.']
# алфавит(укр)
alphabet = ['а', 'б', 'в', 'г', 'ґ']
print(f"\nСписок до --> {text}")
# список для результата
resultWord = []
if len(text) >= 2 and len(text) <= 20:
    for word in text:
        if word == '.':
            break
        if len(word) < 6:
            wordEnd = text[-2]
            # делим слово на буквы
            wordList = list(word)
            # временная переменная для сборки слова(list)
            tmp = []
            # временная переменная для сборки слова(str)
            result = ''
            # проход цикла по буквам слова
            for j in wordList:
                # проверка на то что слово начинается ли оно как в алфавите
                if wordList[0] == 'а':
                    # проход цикла по буквам алфавита
                    for i in alphabet:
                        # проверка на то что буквы в слове идут в алфавитном порядке
                        if i == j:
                            # добавляем букву слова в список tmp чтобы потом сложить из них слово
                            tmp.append(j)
                            # сборка слова из букв
                            result = ''.join(tmp)
            # проверка на то что результат равен слову которое мы получили
            if len(word) == len(result) and result != wordEnd:
                resultWord.append(result)
    print(f"Список після --> {resultWord}")
